---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConstraintFailures.UndeletedConstraintsLabel
source: html/37a59c62-fd99-262e-7609-2d2315d90b8d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConstraintFailures.UndeletedConstraintsLabel Property

A dimension labeled by a parameter is being deleted, but the elements will still be constrained. Push "Unconstrain" to remove the constraints or "OK" to leave elements constrained..

## Syntax (C#)
```csharp
public static FailureDefinitionId UndeletedConstraintsLabel { get; }
```